-- 职业数据初始化脚本
-- 根据职业及初始资源.txt文件生成

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- 职业表(job)数据录入
-- ----------------------------

INSERT INTO `job` (`name`, `skills`, `created_at`, `updated_at`) VALUES
-- 统治组
--('镇长', '射击', NOW(), NOW()),
--('监狱长', '格斗,急救', NOW(), NOW()),
--('警长', '射击', NOW(), NOW()),
--('隐藏统治者', '', NOW(), NOW()),
-- 治安组
--('治安官', '射击', NOW(), NOW()),
('民兵', '格斗', NOW(), NOW()),
('巡夜人', '格斗,巡逻', NOW(), NOW()),
-- 生产组
('农户', '食物生产', NOW(), NOW()),
('伐木工', '伐木', NOW(), NOW()),
('矿工', '挖掘', NOW(), NOW()),
('铁匠', '炼铁', NOW(), NOW()),
('手工艺人', '手工艺', NOW(), NOW()),
('工匠', '木石工艺', NOW(), NOW()),
-- 港口组
('渔民', '捕鱼,格斗', NOW(), NOW()),
('水手', '航海,格斗', NOW(), NOW()),
('船长', '远洋导航,射击', NOW(), NOW()),
('装卸工', '搬运,斗殴', NOW(), NOW()),
('采珠人', '潜水,捕鱼', NOW(), NOW()),
-- 公共组
('神父', '布道,医疗', NOW(), NOW()),
('赤脚医生', '医疗,急救', NOW(), NOW()),
('杂货店主', '囤货', NOW(), NOW()),
('旅店店主', '囤货', NOW(), NOW()),
('酒馆老板', '囤货', NOW(), NOW()),
('灯塔看守员', '射击', NOW(), NOW()),
('面包师', '烘焙', NOW(), NOW()),
-- 特殊组
('向导', '急救,潜行', NOW(), NOW()),
('猎户', '射击,潜行', NOW(), NOW()),
('邮递员', '潜行', NOW(), NOW()),
('守墓人', '通灵', NOW(), NOW()),
('气象观测员', '天气预测', NOW(), NOW()),
('占卜师', '占星', NOW(), NOW()),
('设施维护人', '维修', NOW(), NOW()),
('教师', '启蒙', NOW(), NOW());

SET FOREIGN_KEY_CHECKS=1;